Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་གྲགས་འཕགས་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ། ལྷག་པར་བྱ་བ་བྱས་པ། ཚངས་པར་སྤྱོད་པ་ཡུན་རིང་དུ་སྤྱད་པ། བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Noble Fame. He had served and created roots of virtue with countless thus-gone ones, maintained chastity for a long time, and had innumerable qualities of a bodhisattva.

source: དེ་ཉིད་མཚན་དུ་འཇིག་རྟེན་ན་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་གང་དག་འཁོར་བ་ལས་ངེས་པར་འབྱུང་བ་རབ་ཏུ་ཤེས་པ་སུ་ཡོད་ཀུན་ཏུ་ཚོལ་ལོ། །
en: Day and night he searched the world for ascetics and brahmins who knew how to escape from cyclic existence.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་མངོན་པར་བསྒྲགས་པའི་དབྱངས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། དེ་རྒྱལ་པོའི་ཕོ་བྲང་ཤིན་ཏུ་དུལ་ལྡན་ཞེས་བྱ་བ་ན་བཞུགས་ཤིང་གནས་སོ། །
en: At the same time, in the kingdom known as Utterly Disciplined there had appeared in the world a thus-gone one named Voice Proclaiming the Cloud of Dharma.

source: མི་རྣམས་ཀྱི་སེམས་ཤིན་ཏུ་དུལ་བ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་
en: There the people had calm minds and were well settled in the Great Vehicle.

source: དེ་དག་ཐམས་ཅད་ཀྱི་གནས་ནི་ཀུན་དགའ་ར་བ་ཕུན་སུམ་ཚོགས་པ་དང་། ཚལ་ཕུན་སུམ་ཚོགས་པ་དང་། འབབ་ཆུ་ཕུན་སུམ་ཚོགས་པ་དང་། སྐྱེད་མོས་ཚལ་ཕུན་སུམ་ཚོགས་པ་སྟེ། ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་དང་འཐུན་པ་ཡིན་ནོ། །
en: They all made their homes among splendid gardens, groves, waterfalls, and parks, and lived according to the principles of pure conduct.

source: རྒྱལ་པོ་གྲགས་འཕགས་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་སྤྲིན་མངོན་པར་བསྒྲགས་པ་རྒྱལ་པོའི་ཕོ་བྲང་ཤིན་ཏུ་དུལ་ལྡན་ན་བཞུགས་ཤིང་གནས་ཏེ་དེ་འཁོར་བ་ལས་ངེས་པར་འབྱུང་བ་རབ་ཏུ་མཁྱེན་ཏོ། །ཞེས་ཐོས་སོ། །
en: Once, King Noble Fame was told, ‘The blessed, thus-gone, worthy, perfect buddha Voice Proclaiming the Cloud of Dharma lives in the kingdom of Utterly Disciplined and he knows how to escape from cyclic existence.’

source: ཐོས་ནས་ཀྱང་ཤིང་རྟ་སྟོང་ཕྲག་དྲུག་ཅུ་དང་། མི་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དྲུག་དང་རྒྱལ་པོའི་ཕོ་བྲང་ཤིན་ཏུ་དུལ་ལྡན་ནས་བྱུང་སྟེ།
en: “Hearing this news, with sixty thousand chariots and nine hundred sixty million people, he immediately departed from the royal palace in the kingdom of Utterly Disciplined.

source: རྒྱལ་པོའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། རྒྱལ་པོའི་མཐུ་ཆེན་པོས་སྤྲིན་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་གང་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་མངོན་པར་འཕགས་པའི་དབྱངས་བཞུགས་པ་དེར་སོང་སྟེ་ཕྱིན་ནས་
en: In the great pomp and power of royalty, they set off toward the Cloud Grove Park where the blessed thus-gone Voice Proclaiming the Cloud of Dharma was dwelling.

source: ཇི་ཙམ་དུ་བཞོན་པར་བྱ་བའི་ས་དེ་ཙམ་དུ་བཞོན་པས་སོང་ནསརྐང་པས་སྤྲིན་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་དེ་ཉིད་དུ་ཞུགས་ཏེ།
en: He rode as far as he could before entering the Cloud Grove Park on foot.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་སྤྲིན་མངོན་པར་བསྒྲགས་པའི་དབྱངས་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: There he went before the blessed, thus-gone, perfect buddha Voice Proclaiming the Cloud of Dharma, bowed his head at the feet of the Thus-Gone One, and then sat off to one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་རྒྱལ་པོ་གྲགས་འཕགས་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་མངོན་པར་བསྒྲགས་པའི་དབྱངས་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Sitting there, King Noble Fame addressed the blessed thus-gone Voice Proclaiming the Cloud of Dharma in verse:

source: གྲགས་པ་ཆེན་པོ་གཟི་བརྗིད་ཆེ། །
en: “ ‘O you who are so famed and magnificent,

source: ཚོགས་ཆེན་འོད་ནི་ཆེན་པོ་ལགས། །
en: So luminous in this great assembly,

source: ཀུན་མཁྱེན་རྫུ་འཕྲུལ་ཆེན་པོ་བརྙེས། །
en: Omniscient One, You have achieved great miraculous powers.

source: འདྲེན་པ་མཐའ་ཡས་དག་གི་ཡབ། །
en: You are the father of infinite guides.

source: སྒྲོལ་བ་འདོད་ཆགས་ཟུག་རྔུ་འབྱིན། །
en: “ ‘Liberated One, you soothe the pangs of desire.

source: སྨན་པ་ཆེན་པོ་གསོས་སྨན་ལགས། །སྒྲོལ་བ་རྨ་རྣམས་གསོ་བར་མཛད། །
en: O great doctor, O physician, Liberated, you are a healer of wounds.

source: རྐང་གཉིས་མཆོག་ནི་བདག་ལ་གསུངས། །
en: Foremost of humans, please teach me!

source: ཚུལ་ཁྲིམས་ཕུང་ལ་ཤིན་ཏུ་བཞུགས། །ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་གཤེགས། །
en: “ ‘Immersed in the accumulation of discipline, You perfected absorption.

source: ཤེས་རབ་ཕུང་ལ་ཤིན་ཏུ་བཞུགས། །དེས་བཅོམ་རྣམ་པར་གྲོལ་བ་བསྒྲུབས། །
en: Immersed in the accumulation of insight, You conquered and achieved liberation.

source: འཇིག་རྟེན་གསུམ་ལས་ཤིན་ཏུ་བྱུང་། །
en: “ ‘You have transcended the three worlds,

source: སྡུག་བསྔལ་ཀུན་ལ་འཇིགས་མི་མངའ། །
en: And are unafraid of any pain.

source: རབ་ཏུ་གསལ་མཛད་སྐམ་ལ་བཞུགས། །
en: Utterly luminous, you have arrived on dry ground,

source: འཇིགས་དང་འཇིགས་པར་བྱེད་ལས་རྒལ། །ཞུས་པ་རྣམས་ཀྱི་མཐར་མཛད་ཅིང་། །ཐེ་ཙོམ་རྣམས་ནི་སེལ་བ་པོ། །
en: Having crossed fear and danger. “ ‘You put an end to questions And dispel all doubts.

source: གནས་མཆོག་དག་ནི་བརྙེས་པ་སྟེ། །འཇིག་རྟེན་ཀུན་གྱི་མཆོད་རྟེན་ལགས། །
en: Having gained the supreme site, You are a shrine for the entire world.

source: ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། །མིའམ་ཅི་དང་ལྟོ་འཕྱེར་བཅས། །ཐུབ་ཁྱོད་གང་ལ་བཞུགས་པ་ཡི། །དགོངས་པའི་རྣམ་པ་མ་འཚལ་ཏོ། །
en: “ ‘No gods, nāgas, yakṣas, Kiṃnaras, or mahoragas Understand the realization In which you dwell, O Sage.

source: ལྷ་རྣམས་དང་ནི་དྲི་ཟ་དང་། །གནོད་སྦྱིན་དང་ནི་སྲིན་པོས་ཀྱང་། །ཐུབ་པ་ཁྱོད་ཀྱིས་གང་བརྙེས་པའི། །ལམ་དེ་རྣམ་པར་མ་འཚལ་ཏོ། །
en: “ ‘No gods, gandharvas, Yakṣas, or rākṣasas Understand the path You have achieved, O Sage.

source: འཇིག་རྟེན་འདས་པ་རབ་ཏུ་གསལ། །
en: “ ‘Transcender of the world, luminous one,

source: གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་ཀྱི། །གང་གིས་འདྲེན་པ་བཞུད་པ་ནི། །དེ་ཡི་ལམ་གྱིས་གཤེགས་པར་གྱུར། །
en: You have traveled the path Traversed by the guides, As numerous as the sand grains of the Ganges River.’

source: དེ་ནས་རྒྱལ་པོ་གྲགས་འཕགས་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྤྲིན་མངོན་པར་བསྒྲགས་པའི་དབྱངས་དེ་ལ་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་པའི་དགེ་བའི་རྩ་བ་དེས་བསྐལ་པ་ཁྲི་ཕྲག་དགུ་བཅུར་ལོག་པར་མ་ལྷུང་ངོ་། །
en: “Due to the roots of virtue from having thus praised in verse the blessed thus-gone Voice Proclaiming the Cloud of Dharma, King Noble Fame avoided going astray for nine hundred thousand eons.

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གྲགས་འཕགས་ཞེས་བྱ་བ་ཆགས་པ་ཐམས་ཅད་ལ་རབ་ཏུ་གྲོལ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time King Noble Fame, who was liberated from all attachment, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གྲགས་འཕགས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Noble Fame.

source: དགེ་བའི་རྩ་བ་དེས་ང་བསྐལ་པ་ཁྲི་ཕྲག་དགུ་བཅུར་ལོག་པར་མ་ལྟུང་ངོ་། །
en: Due to those roots of virtue, I did not go astray for nine hundred thousand eons.

source: ད་ལྟར་ཡང་ང་རྣམ་པར་ཐར་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཐུགས་སུ་ཆུད་དོ། །
en: And now I have realized the knowledge of cessation as related to knowledge of liberation.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ཐར་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་པར་རྫོགས་པར་ཤེས་པར་འདོད་པས་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་ཆགས་པ་མེད་ཅིང་གྲོལ་བར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas who wish to perfectly understand the knowledge of cessation as related to knowledge of liberation should be unattached and free with regard to any possessions.

source: མཽད་གལ་གྱི་བུ་ངས་རྣམ་པར་ཐར་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས།
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I wondered, ‘How can I genuinely teach sentient beings once I have fully awakened to unsurpassed and perfect buddhahood?’ With this thought

source: དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: I created numerous different roots of virtue in order to understand the path that leads to cessation as related to knowledge of liberation.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་ཡོད་གཤེགས་ཞེས་བྱ་བ་ནས་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone, worthy, perfect buddha named Meaningful Arrival;

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དོན་ཡོད་གཤེགས་དེའི་ཉན་ཐོས་འདུས་པ་དང་པོ་ཁྲི་བྱུང་ངོ་། །
en: The first assembly of hearers belonging to the thus-gone, worthy, perfect buddha Meaningful Arrival numbered ten thousand

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་ནི་དེའི་ཉིས་འགྱུར་བྱུང་ངོ་། །
en: and his assembly of bodhisattvas was double that number.

source: ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་ཉན་ཐོས་དགྲ་བཅོམ་པ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ། ཁྲི་ཕྲག་སྟོང་ཐམ་པ་བྱུང་ངོ་། །
en: His second assembly of hearers numbered ten million.

source: བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་གཉིས་པ་ནི་དེའི་ཉིས་འགྱུར་བྱུང་ངོ་། །
en: The second assembly of bodhisattvas was double that.

source: ཉན་ཐོས་འདུས་པ་གསུམ་པ་ནི་ཉན་ཐོས་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་བྱུང་ངོ་། །
en: His third assembly of hearers included countless billions of hearers.

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་དོན་ཡོད་གཤེགས་དེའི་གསུང་རབ་ལ་དགེ་སློང་གྲགས་པའི་འོད་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོ་ལ་རབ་ཏུ་གནས་པ་ཞིག་བྱུང་ངོ་། །
en: “Maudgalyāyana, present during the thus-gone Meaningful Arrival’s discourses was a monk named Famous Light who lived by the Great Vehicle.

source: རྩོམ་པ་འདི་ལྟ་བུ་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: He had made the following commitment:

source: བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་ཐོབ་ཀྱི་བར་དུ་ལུས་དང་པགས་པ་དང་རྒྱུས་པ་དང་རུས་པ་ཡང་སྐམས། ཁོག་པ་དང་ཤ་དང་ཁྲག་ཡོངས་སུ་སྐམས་ཀྱང་བརྩོན་འགྲུས་འདི་ཉིད་མི་གཏོང་ངོ་། །
en: ‘Until I achieve unsurpassed and perfect awakening, I will not forsake diligence, even if my body, skin, sinews, and bones dry up—even if my guts, flesh, and blood entirely dry up.’

source: དེ་དེ་བཞིན་གཤེགས་པ་དོན་ཡོད་གཤེགས་དེའི་སྤྱན་སྔར་རས་བཅོས་བུ་ཡུག་ཅིག་གིས་ལུས་དཀྲིས་ནས་ཏིལ་མར་གྱིས་བྱུགས་ཏེ་མེ་སྦར་ནས་སྤྱན་སྔར་མར་མེ་བུས་སོ། །
en: So, in the presence of the thus-gone Meaningful Arrival he draped his body in a piece of cotton cloth, which he doused with sesame oil before setting himself on fire, thus turning himself into a torch.

source: མེ་འབར་བས་ལུས་སྲེག་པ་ན་དེ་བཞིན་གཤེགས་པ་དོན་ཡོད་གཤེགས་དེ་ལ་ཚིགས་སུ་བཅད་པས་མངོན་པར་བསྟོད་པ།
en: Once the blazing flames had consumed his body, he praised the thus-gone Meaningful Arrival with these verses:

source: རྣམ་འདྲེན་རང་བྱུང་ཐུགས་དག་མཐའ་ཡས་མཆོག །
en: “ ‘O Guide, your supreme self-arisen mind is infinite.

source: སྐྱོན་དང་རྒྱགས་དང་ཉེས་པ་སྤངས་པ་ལགས། །
en: You have left behind faults, vanity, and flaws.

source: འགྲོ་བ་ལམ་ངན་ཞུགས་ལ་ཐུགས་རྗེ་བསྐྱེད། །
en: You are compassionate to beings on wrong paths—

source: ཀུན་ཏུ་གཟིགས་པ་གནས་མཆོག་བསྟན་དུ་གསོལ། །
en: Please teach, O all-seeing , supreme object of reverence!

source: སྐྱེ་བོ་བློ་ཉམས་སྡུག་བསྔལ་རབ་ཏུ་སྡུག ། མིག་ཉམས་གནས་མེད་ཡོངས་སུ་འཁྱམ་པ་ལ། །སྙིང་རྗེ་ཆེན་པོ་དཔག་མེད་བསྐྱེད་ནས་སུ། །འགྲོ་བ་ཐར་པར་བགྱི་སླད་སྤྱོད་པ་སྤྱད། །
en: “ ‘Beings with degenerate minds in their utter suffering Roam around, aimless and blind— Having developed great compassion for them, I act to liberate such beings.

source: བདག་ནི་བདག་ལ་དགའ་བར་མི་བགྱིད་དེ། །འགྲོ་བ་ལམ་གོལ་མཆི་བ་འདི་ལ་ལྟ། །
en: “ ‘I do not take pleasure in the ego, But keep watch on beings on wrong paths.

source: འདོད་ཆགས་ཞེ་སྡང་འབར་བས་འགྲོ་བ་གདུངས། །དེ་དག་བདག་གི་ལམ་ཆུས་ཞི་བར་བགྱི། །
en: Beings suffer from blazing desire and anger, Which I quell with the water of my path.

source: དྲང་སྲོང་ཆེན་པོ་སྟོབས་བཅུ་ཁྱོད་ཀྱི་བསླབ། །བདག་གི་དངོས་ལ་ལྟོས་མེད་སྤྱོད་པ་སྤྱད། །
en: “ ‘Great Sage, you who have the ten powers, I practice your doctrine without concern for myself.

source: འགྲོ་བ་འདི་དག་འབར་བས་སྲེག་པ་ན། །བདུད་རྩིའི་ཆབ་ཀྱིས་བསིལ་བར་གྱུར་པར་བགྱི། །
en: When these beings are burning up, I will cool them with ambrosial water.

source: སེམས་ཅན་དོན་དུ་བདག་གི་ལུས་བསྲེགས་པས། །སེམས་ཅན་ཀུན་གྱི་ལུས་ལ་ནད་མེད་ཤོག །
en: “ ‘By thus burning my body for beings’ sake May all beings be physically free of illness.

source: སེམས་ཅན་དོན་དུ་བདག་གིས་འབད་པ་འདི། །སེམས་ཅན་སྡུག་བསྔལ་གནོད་པ་མེད་གྱུར་ཅིག །
en: May my struggle for the sake of beings Eliminate all beings’ harm and suffering.’

source: འདྲེན་པ་དེ་ལ་མཆོད་པ་བྱས་པ་དང་། །བདེ་བར་གཤེགས་ལ་ང་ཡི་དངོས་པོ་ཕུལ། །
en: “Having thus honored the Guide, Having offered myself to the Blissful One,

source: སངས་རྒྱས་མཆོད་བྱས་བསྐལ་ཆེན་བརྗོད་དུ་མེད། །སུམ་ཅུ་དྲུག་ཏུ་ངན་འགྲོར་མ་སོང་ངོ་། །
en: Having thus paid reverence, for thirty-six inexpressible great eons I did not fall into the lower realms.

source: རྟག་ཏུ་ལྷར་སོང་མི་ཡི་འཇིག་རྟེན་འཐོབ། །ང་ནི་གསལ་བ་དག་དང་དབང་ཕྱུག་གྱུར། །
en: “Always migrating among the gods or reaching the human world, I became a luminous one, a lord,

source: རྟག་ཏུ་འགྲོ་དང་འཐུན་པར་འཁོར་ལོ་བསྐོར། །ལྷ་དང་མི་རྣམས་ཀྱིས་ནི་ང་མཆོད་དོ། །
en: Constantly turning the wheel in accord with beings, Worshiped by gods and humans.

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲགས་པའི་འོད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva Famous Light was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲགས་པའི་འོད་ཅེས་བྱ་བར་གྱུར་ཏེ།
en: In those days I was the bodhisattva known as Famous Light.

source: ངས་བརྩོན་འགྲུས་དེ་ལྟ་བུ་བརྩམས་པར་གྱུར་ཏོ། །
en: Such was the diligence that I applied.

source: བརྩོན་འགྲུས་བརྩམས་པ་དེས་ངས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་སོ། །
en: By applying diligence in that way, I was able to bring the perfection of diligence to its full measure.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should apply diligence.

source: བརྩོན་འགྲུས་བརྩམས་པས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་ཀྱི། ལེ་ལོས་ནི་མ་ཡིན་ནོ། །
en: It is through diligence that one can fully awaken to buddhahood, not through laziness.”

source: མཽད་གལ་གྱི་བུ་ངས་ཏིང་ངེ་འཛིན་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཡུལ་ལ་དབང་པོ་གཡེང་བ་རྣམས་བདག་གིས་བསམ་གཏན་མཉམ་པ་ལ་ཇི་ལྟར་སྦྱར་བར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand absorption. I did this by pondering how I could use the equanimity of concentration against my senses being distracted by objects.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་དྲང་སྲོང་སྐྱེ་བ་ཚོལ་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a former king, now a sage, named King Birth Seeker.

source: དེ་རྒྱལ་སྲིད་སྤངས་ནས་རབ་ཏུ་བྱུང་སྟེ།
en: He had given up royal affairs to ordain.

source: དེ་རབ་ཏུ་བྱུང་བའི་དབང་པོ་ཡུལ་རྣམས་ལ་རྣམ་པར་གཡེང་ངོ་། །
en: Yet despite having ordained, his senses were distracted by objects.

source: ཀྱེ་ཨེ་མ་ཀྱི་ཧུད་བདག་གིས་ཡུལ་གང་དག་བཏང་ནས་རབ་ཏུ་བྱུང་བ་ཡིན་ན་དབང་པོ་རྣམ་པར་གཡེང་བ་ནི་མ་ལེགས་ཤིང་རུང་བ་མ་ཡིན་ཏེ།
en: ‘Oh, how sad! Having forsaken all objects and ordained, it is unfit and improper that my senses are yet distracted.

source: དེས་དབང་པོ་རྣམ་པར་འཁྲུལ་པ་ཡུལ་གྱི་གཟེབ་ལ་བཅུག་པ་དེ་དག་ནམ་མཁའ་ལྟ་བུར་མཉམ་པའི་ཏིང་ངེ་འཛིན་ལ་བརྟེན་ནས་སྟོབས་ཆེན་པོ་ཕ་རོལ་གནོན་པ་ཡང་དག་པར་བསྐྱེད་པར་བྱ་བ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ནམ་མཁའ་ལྟར་མཉམ་པའི་ཏིང་ངེ་འཛིན་གང་ཡིན་སྙམ་མོ། །
en: With my deluded senses so caught in the cage of objects, I must apply concentration that is like space, and thereby develop the great strength to defeat all opponents. If I am to do this, though, what is the equipoise of bodhisattva great beings that is like space?’

source: དེ་ནས་རྒྱལ་པོ་དྲང་སྲོང་སྐྱེ་བ་ཚོལ་བ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then King Birth Seeker reflected,

source: ཆོས་འདི་དག་ཐམས་ཅད་ནི་ནམ་མཁའ་དང་མཉམ་མོ། །
en: ‘All these phenomena are like space.

source: འདི་ལྟ་སྟེ་དཔེར་ན་ནམ་མཁའ་ལ་ནི་ཐོགས་པ་མེད་དོ། །
en: In the sense that there is nothing obstructing space,

source: དེ་བཞིན་དུ་ཡུལ་ཐམས་ཅད་ནི་ནམ་མཁའ་དང་འདྲའོ། །
en: all objects are similar to space.

source: ཡོངས་སུ་མི་རྟོག་པ་ནི་ཐོགས་པ་མེད་དོ། །
en: Non-conceptuality is unobstructed;

source: ཡོངས་སུ་མི་རྟོག་པ་ནི་ཐར་པའོ། །
en: non-conceptuality is liberation.

source: ཡོངས་སུ་རྟོག་པ་ནི་འཆིང་བའོ། །
en: Conceptuality is a fetter,

source: ཡོངས་སུ་མི་རྟོག་པ་ནི་འཆིང་བ་གཅོད་པའོ། །
en: while non-conceptuality is what cuts that fetter.

source: འོན་ཏང་བདག་གིས་ཡོངས་སུ་རྟོག་པ་ནི་གཏང་བར་བྱའོ་སྙམ་མོ། །
en: So I will give up conceptuality.’

source: དེའི་ཚེ་དེ་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ཡང་དག་པར་གཅད་པར་བྱ་བ་ལ་ཞུགས་སོ། །
en: “He then set himself to the task of severing all attachments.

source: དེ་ནམ་མཁའ་ལྟར་མཉམ་པའི་ཏིང་ངེ་འཛིན་ཐོབ་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: Achieving the absorption that is like space, he attained acceptance that phenomena are unborn.

source: དེའི་ཚེ་དེ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྟོབས་བསྐྱེད་པ་ཐོབ་པས་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་མངོན་པར་འཕགས་ཏེ་བར་སྣང་ལ་སོང་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: At that point he was able to develop the power over the realm of phenomena, and so he levitated to the height of seven palm trees. There in midair, he uttered these verses:

source: མི་གང་ཐོགས་མེད་ཆོས་ནི་རྗེས་སུ་རྟོགས། །དེ་ནི་སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་ཤེས། །
en: “ ‘Whoever realizes the principle of non-obstruction Has understood the domain of all buddhas,

source: སྔོན་གྱི་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ཞུགས། །ཆོས་ཀྱི་རྒྱལ་པོ་རྣམས་ཀྱི་ཆོས་རྣམས་ཤེས། །
en: Penetrated the domain of the past buddhas, And comprehended the doctrine of the Dharma kings.

source: ཆོས་འདི་ཐམས་ཅད་ནམ་མཁའ་ལྟ་བུ་སྟེ། །
en: “ ‘All these phenomena are like space;

source: ཆོས་ཉིད་ཤེས་པར་བྱ་བ་ཡོད་པ་མེད། །
en: There is no nature of things to comprehend.

source: ཆོས་ཉིད་ལ་ནི་ཆོས་ཉིད་གང་མེད་རྟོགས། །
en: Realizing that in the nature of things there is no nature,

source: ཆོས་འདི་ཐམས་ཅད་འགྱུར་མེད་གཉིས་སུ་མེད། །
en: All these phenomena are unchanging and non-dual.

source: ནམས་ཀྱང་སྣ་ཚོགས་ཉིད་ཀྱི་ཆོས་མེད་དེ། །
en: “ ‘Never has there been a multiplicity of things.

source: ཇི་ལྟར་བར་སྣང་དགབ་པ་གང་ཡང་མེད། །
en: Just like there is nothing covering space,

source: རྒྱལ་བས་མྱ་ངན་འདས་པར་ཆོས་མ་བསྟན། །
en: The victors teach no Dharma to nirvāṇa;

source: ཆོས་འདུག་པར་ཡང་རྒྱལ་བས་མ་གསུངས་སོ། །
en: The victors have not even taught there is a Dharma.

source: རྒྱལ་བ་ཐམས་ཅད་གཉིས་མེད་ཆོས་གསུང་སྟེ། །
en: “ ‘All victors teach the doctrine of non-duality,

source: མི་མཁས་གང་དག་སྣ་ཚོགས་ཆོས་བྱེད་པ། །
en: While the unwise practicing their variety of doctrines

source: དེ་ནི་བདུད་ཀྱི་ཞགས་པས་བཅིངས་ནས་ཉལ། །
en: Lie bound in the ropes of Māra.

source: ཆོས་ཉིད་རྗེས་རྟོགས་ཆོས་ནི་གང་ཡང་མེད། །
en: “ ‘Realizing the nature of things, there are no things—

source: ཆོས་ལ་རྨོངས་པ་མེད་ཅིང་མཁས་པའང་མེད། །
en: No confusion about things, and no wisdom about things.

source: གང་དག་བདག་གི་ཆོས་ཉིད་ཆོས་ཤེས་ན། །
en: Whoever understands the doctrine of the nature of the self,

source: གཉིས་མེད་དེས་ནི་ཆོས་ཉིད་རྗེས་སུ་ཐོབ། །
en: Attains the nature of things within that non-duality.

source: མི་མཁས་གང་དག་སྣ་ཚོགས་ཆོས་བྱེད་ན། །དེ་དག་བདུད་ཀྱི་སྤྱོད་ཡུལ་སྤྱོད་པ་ཡིན། །
en: “ ‘When the unwise practice their variety of doctrines, They are engaging in the domain of Māra,

source: གང་དག་གཉིས་མེད་ཆོས་སྨྲ་གཉིས་སུ་མེད། །དེ་དག་འདྲེན་པ་ཡབ་འདྲ་སངས་རྒྱས་སྲས། །
en: While those non-dualists who expound a doctrine of non-duality Are children of the buddhas—the paternal guides.

source: གང་ཡང་མ་མཐོང་གང་ཡང་ཐོས་པ་མེད། །
en: “ ‘There is nothing to see and nothing to hear.

source: མི་དག་ཆོས་རྣམས་སྣ་ཚོགས་བྱེད་པ་ནི། །རྒྱལ་བའི་བྱང་ཆུབ་ལ་ནི་དེས་མ་རྟོགས། །
en: Those who practice a variety of doctrines Fail to realize the awakening of the Victor.

source: འདི་ལྟར་རྒྱལ་བ་ལམ་གཉིས་མི་གསུང་སྟེ། །གང་དག་ཆོས་གཉིས་ལ་ནི་དེ་མི་སྤྱོད། །གང་དག་ཚུལ་གཅིག་ཏུ་ནི་ཆོས་རྟོགས་པ། །ལམ་གོལ་མི་འགྲོ་སངས་རྒྱས་བྱང་ཆུབ་ཀྱི། །སངས་རྒྱས་བཞུགས་ལ་མི་དེ་སྤྱོད་པར་འགྱུར། །
en: Thus the Victor did not teach two paths. “ ‘People who do not engage in a duality of things, Who realize the Dharma in a single manner, Do not veer off onto wrong paths but practice Where the buddhas dwell in their awakening.’

source: དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོང་སྐྱེ་བ་ཚོལ་བ་ཞེས་བྱ་བ། གང་ཕ་རོལ་ལས་སྒྲ་མཐོས་པར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the sage King Birth Seeker—who achieved acceptance that phenomena are unborn without learning it from another—was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དྲང་སྲོག་སྐྱེ་བ་ཚོལ་བ་ཞེས་པར་གྱུར་ཏོ། །
en: In those days I was the sage King Birth Seeker.

source: དགེ་བའི་རྩ་བ་དེས་ང་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུར་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེས་པ་ན་དེ་བཞིན་གཤེགས་པ་ཡིན་ནོ། །ཞེས་འདུ་ཤེས་སུ་མ་གྱུར་ཏོ། །
en: Due to those roots of virtue, I was reborn in a buddha realm for eight hundred million years, where the notion ‘the Thus-Gone One is’ did not occur.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་སངས་རྒྱས་བྱུང་བ་དང་ཕྲད་ཀྱང་རུང་མ་ཕྲད་ཀྱང་རུང་། ཆོས་ཟབ་མོ་ལ་རྣམ་པར་ཤེས་ཤིང་རྟོགས་པར་བྱ་བའི་ཕྱིར་རྣལ་འབྱོར་དུ་བྱའོ། །
en: Therefore, Maudgalyāyana, those noble sons or daughters who want to fully awaken to unsurpassed and perfect buddhahood should train to gain understanding and realization of the profound Dharma whether buddhas appear and they meet them or not.

source: མཽད་གལ་གྱི་བུ་ངས་ཏིང་ངེ་འཛིན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་དགེ་བའི་རྩ་བ་རྣམ་པ་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Furthermore, Maudgalyāyana, I created numerous roots of virtue in order to understand the origin as related to knowledge of absorption.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་གྲགས་པ་བསྒྲགས་པ་ཞེས་བྱ་བ་
en: Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone, worthy, perfect buddha named Proclaimer of Fame;

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་གྲགས་པ་བསྒྲགས་པ་དེའི་ཉན་ཐོས་འདུས་པ་གཉིས་བྱུང་སྟེ།
en: Maudgalyāyana, the thus-gone Proclaimer of Fame had a twofold following of hearers.

source: ཉན་ཐོས་འདུས་པ་གཅིག་ནི་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་བདུན་ཅུ་རྩ་བདུན་གྱི་ཉན་ཐོས་འདུས་པ་བྱུང་ངོ་། །
en: One of his assemblies of hearers consisted of a gathering of seventy-seven quintillion hearers.

source: ཉན་ཐོས་འདུས་པ་གཉིས་པ་ནི་ཉན་ཐོས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་བྱུང་སྟེ།
en: The second gathering consisted of one hundred sextillion hearers.

source: དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ་ཉོན་མོངས་པ་མེད་པ་དབང་དུ་གྱུར་པ་སེམས་ཐམས་ཅད་ཀྱི་དབང་དམ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་སོ། །
en: All were worthy ones whose defilements were exhausted, who were free of afflictions, controlled, and who had obtained supreme perfection in mastering all mental states.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཤིང་ལྗོན་པ་ཕན་པ་མེད་པ་ཞིག་བྱུང་ངོ་། །
en: “There was in that buddha realm then a fruitless tree.

source: དེའི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དགེ་སློང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པ་ཞིག་བྱུང་སྟེ།
en: He was a monk named Thinker of Every Object who lived there in the buddha realm and who genuinely abided by the Great Vehicle.
